import pickle
def data_2_pickle():
    data = [
        {"Автор":"Булгаков М.А.",
         "Название":"Мастер и Маргарита",
         "Количество_страниц":"100"
         },
        {"Автор": "Булгаков М.А.",
         "Название": "Собачье сердце",
         "Количество_страниц": "100"
         },
        {"Автор": "Толстой Л.Н.",
         "Название": "Война и мир",
         "Количество_страниц": "100"
         },
        {"Автор": "Толстой Л.Н.",
         "Название": "Анна Каренина",
         "Количество_страниц": "100"
         },
        {"Автор": "test5",
         "Название": "test5",
         "Количество_страниц": "100"
         },
        {"Автор": "Гоголь Н.В.",
         "Название": "Мертвые души",
         "Количество_страниц": "100"
         }
    ]

    with open ('data_base.txt', 'wb') as f:
        pickle.dump(data, f)
data_2_pickle()