import pickle
def data_2_pickle():
    data = [
        {"Автор":"test1",
         "Название":"test1",
         "Количество_страниц":"100"
         },
        {"Автор": "test2",
         "Название": "test2",
         "Количество_страниц": "100"
         },
        {"Автор": "test3",
         "Название": "test3",
         "Количество_страниц": "100"
         },
        {"Автор": "test4",
         "Название": "test4",
         "Количество_страниц": "100"
         },
        {"Автор": "test5",
         "Название": "test5",
         "Количество_страниц": "100"
         },
        {"Автор": "test6",
         "Название": "test6",
         "Количество_страниц": "100"
         }
    ]
    with open ('data_base.txt', 'wb') as f:
        pickle.dump(data, f)